# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.
number = input("Введите номер месяца ")
date_mounth = dict({'1': "Январь",
                    '2': "Февраль",
                    '3': "Март",
                    '4': "Апрель",
                    '5': "Май",
                    '6': "Июнь",
                    '7': "Июль",
                    '8': "Август",
                    '9': "Сентябрь",
                    '10': "Октябрь",
                    '11': "Ноябрь",
                    '12': "Декабрь"})
for char in number:
    guess = date_mounth.get(char)
    print("Введеный месяц",guess)
    break
    import os
    os.system("pause")