# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.

# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.

# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
from sys import argv
from itertools import cycle

script_name, iter_num = argv
print(f'название файла {script_name}')
print(f'количество итераций цикла {iter_num}')
i = 0
for el in cycle('abcd'):
    if i > int(iter_num)-1:
        break
    print(i, "==",el)
    i+=1
