# Создать (программно) текстовый файл, записать в него программно набор чисел,
# разделенных пробелами.
# Программа должна подсчитывать сумму чисел в файле и выводить ее на экран.
with open("task5_txt.txt", "w+") as f:
    line = input("Введите число через пробел ")
    f.writelines(line)

    my_sum = line.split()
    print(sum(map(int, my_sum)))
